function J₁ₖ()
    return ((n+1)*h)^(α-1)/β*(((k+1)*h)^β*pFq([β, 1-α], [1+β], (k+1)/(n+1)) - (k*h)^β*pFq([β, 1-α], [1+β], k/n))
end

function J₂ₖ()
    return ((n+1)*h)^(α-1)/(β*(β+1)) * (β*((k+1)*h)^(β+1)*pFq([1+β, 1-α], [2+β], (k+1)/(n+1)) - ((k+1)*h)^(β+1)*(1+β)*pFq([β, 1-α], [1+β], (k+1)/n) - β*(k*h)^(β+1)*pFq([1+β, 1-α], [2+β], k/(n+1)) + h*(k*h)^β*(1+β)*(1+k)*pFq([β, 1-α], [1+β], k/n)    )
end

function j₃ₖ()
    return ((n+1)*h)^(α-1)/(β*(β+1)*(β+2)) * (     β*(β+1)*((k+1)*h)^(β+2)*pFq([2+β, 1-α], [3+β], (k+1)/(n+1)) - 2*β*(β+2)*(k+1/2)*h*((k+1)*h)^(β+1)*pFq([1+β, 1-α], [2+β], (k+1)/(n+1))  +  k*h*(β+2)*(β+1)*((k+1)*h)^(β+1)*pFq([β, 1-α], [1+β], (k+1)/n)   +  2*β*(β+2)*(k+1/2)*h*(k*h)^(β+1)*pFq([1+β, 1-α], [2+β], k/(n+1))  -  β*(β+1)*(k*h)^(β+2)*pFq([2+β, 1-α], [3+β], k/(n+1))    -  h*(β+2)*(β+1)*(k+1)*(k*h)^(β+2)*pFq([β, 1-α], [1+β], k/(n+1))     )
end